app/controllers/application_controller.rb

  def cities
  	if(params[:region_id])
  		respond = Region.find(params[:region_id]).cities
  	else
  		respond = City.all
---
SELECT "cities".* FROM "cities" WHERE "cities"."region_id" = 1016
SELECT "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", "1016"]]
SELECT "cities".* FROM "cities"