app/views/application/index.html.haml

.regions
	= collection_select(:region, :id, Region.all, :id, :name, :include_blank => true)
---
SELECT "regions".* FROM "regions" LIMIT 1